package com.example.drawable;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

public class ma extends AppCompatActivity {

    TextView ma, mas;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_ma);

        ma=findViewById(R.id.tvma);
        mas=findViewById(R.id.tvmas);
        ma.setText(Html.fromHtml("<html><h1>বইঃ মা</h1>" +
                "<h2>লেখকঃ আনিসুল হক</h2>" +
                "<h3>ক্যাটাগরিঃ মুক্তিযুদ্ধের উপন্যাস</h3>" +
                "<h3>ভাষাঃ বাংলা</h3>" +
                "<h3>প্রথম প্রকাশঃ ২০০৩</h3></html"));

        mas.setText(Html.fromHtml("<html><h5>আজাদ ছিল তার মায়ের একমাত্র সন্তান। আজাদের বাবা দ্বিতীয় বিয়ে করায় বালক আজাদকে নিয়ে তার মা স্বামীর গ্রিহ-অর্থ-বিত্ত ত্যাগ করে আলাদা হয়ে যান। মা বড় কষ্ট করে ছেলেকে লেখাপড়া করান। আজাদ এমএ পাস করে। এই সময় দেশে শুরু হয় মুক্তিযুদ্ধ। আজাদের বন্ধুরা যোগ দেয় ঢাকার আরবান গেরিলা দলে আজাদ মাকে বলে, আমিও যুদ্ধে যাব। মা তাকে অনুমতি দেন। ছেলে যুদ্ধে যায়। ১৯৭১ সালের ৩০ আগস্ট একরাতে ঢাকার অনেক ক'টা মুক্তিযোদ্ধা-নিবাসে হামলা চালায় পাকিস্তানী সৈন্যরা, আরো অনেকের সঙ্গে ধরা পড়ে রুমী, বদি, আলতাফ মাহমুদ, জুয়েল এবং আজাদ। আজাদের ওপর পাকিস্তানীরা প্রচণ্ড আত্যাচার  চালিয়েও কথা বের করতে পারে না। তখন তার মাকে বলা হয়, ছেলে যদি সবার নাম-ধাম ইত্যাদি বলে দেয়, তাকে ছেড়ে দেয়া হবে। আজাদের মা ছেলের সঙ্গে দেখা করেন এবং বলেন, শক্ত হয়ে থেকো, কারো নামে বলে দিও না। আজাদ বলে, মা দুদিন ভাত খাই না, ভাত নিয়ে এসো। মা পরের দিন ভাই নিয়ে হাজির হন বন্দীশিবিরে, কিন্তু ছেলের দেখা আর মেলে না। আর কোনোদিনও ছেলে তাঁর ফিরে আসে নাই আর এই মা আর কোনোদিনও জীবনে ভাত খান নাই। যুদ্ধের ১৪ বছর পরে মা মারা যান, নিঃস্ব, রিক্ত-বেশে। মুক্তিযোদ্ধারা তাঁকে কবরে শায়িত করলে আকাশ থেকে ঝিরঝির করে ঝরতে থাকে বৃষ্টি।</h5></html>"));
    }
}
