package com.example.drawable;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

public class origin extends AppCompatActivity {

    TextView org, orgs;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_origin);

        org=findViewById(R.id.tvorg);
        orgs=findViewById(R.id.tvorgs);

        org.setText(Html.fromHtml("<html><h1>বইঃ অরিজিন</h1><br>" +
                "<h2>লেখকঃ ড্যান ব্রাউন</h2><br>" +
                "<h3>ক্যাটাগরিঃ থ্রিলার</h3><br>" +
                "<h3>ভাষাঃ ইংরেজি</h3><br>" +
                "<h3>প্রথম প্রকাশঃ ২০১৭</h3></html>"));

        orgs.setText(Html.fromHtml("<html><h5>'বিজ্ঞানের চেহারা চিরদিনের জন্যে পাল্টে দেবে'-- এমন এক যুগান্তকারি ঘোষণার সাক্ষী হয়ে সিম্বোলজিস্ট রবার্ট ল্যাংডন স্পেনের বিলবাওয়ের অত্যাধুনিক গুগেনহাইম জাদুঘরে উপস্থিত হয়েছে। আর এই ঘোষণা দিতে যাচ্ছে তারই এক পুরনো ছাত্র, একচল্লিশ বছর বয়সী ধনকুবের, ফিউচারিস্ট এবং প্রযুক্তি দুনিয়ার প্রাবাদপ্রতীম ব্যক্তিত্ব কিয়ার্শ। তার আবিষ্কার এবং কিছু বক্তব্য আগেও আলোড়ন তুলেছে গোটা দুনিয়া জুড়ে। এমন কিছু উন্মোচন করতে যাচ্ছে সে যা কিনা উত্তর দেবে মানব অস্তিত্ববাদের দুটো প্রধান প্রশ্নের।\n" +
                "কিন্তু অনুষ্ঠান শুরু হতেই ল্যাংডন বুঝতে পারে ভীষণ বিতর্কের জন্ম দিতে যাচ্ছে এডমন্ডের আবিষ্কার। একসময় হঠাত করেই ঘোলাটে হয়ে ওঠে পরিস্থিতি। আবিষ্কারের কথাটা মুখেই থেকে যায় কিয়ার্শের। জাদুঘরের পরিচালক অ্যাম্ব্রা ভিদালের সাথে বিলবাও থেকে পালাতে বাধ্য হয় ল্যাংডন। বার্সেলোনার উদ্দেশ্যে পাড়ি জমায় তারা একটি গোপন, সংরক্ষিত পাসওয়ার্ডের খোঁজে, যেটা কিনা তাদের সাহায্য করবে কিয়ার্শের আবিষ্কার উন্মোচনে।\n" +
                "ধর্মীয় ইতিহাসের পথে ল্যাংডন এবং ভিদালের এই অভিযানে বাঁধা হয়ে দাঁড়ায় ভীষণ শক্তিশালী এক প্রতিপক্ষ, স্পেনের রাজসভা পর্যন্ত যার ক্ষমতা বিস্তৃত। এডমন্ড কিয়ার্শের আবিষ্কারকে কোনভাবেই প্রকাশ হতে দেবে না তারা। আধুনিক চিত্রকলা এবং কিছু গুপ্ত সংকেতের সহায়তায় ল্যাংডন কি পারবে এই আবিষ্কার উন্মোচন করতে? চরম সত্যের মুখোমুখি হতে?</h5></html>"));
    }
}
